@extends('@layouts.app')

@section('content')
    <div class="px-md-4 my-5 pb-3">
        <h1 class="fw-bold text-center">ЗАПЧАСТИ АКПП</h1>
        <div class="text-center">
            <div class="container-fluid px-md-5">
                <img src="/img/i/zapchasti.png"
                     class="img-fluid border rounded-3 shadow-lg mb-4" alt="Example image" width="1300" height="500"
                     loading="lazy">
            </div>
        </div>

        <div class="container">
            <div class="col-lg-10">
                <p class="lead mb-4">
                    "ZF center" предлагает широкий ассортимент запасных частей для всех модификаций АКПП ZF, в том числе
                    гидротрансформаторы и мехатроники для АКПП.
                </p>

                <p class="lead mb-4">
                    Прямые плановые поставки, а также отлаженная система логистики позволяют обеспечивать бесперебойное
                    наличие необходимых запчастей на складе в достаточном количестве и оперативно выполнять крупные
                    заказы клиентов. Благодаря быстрому товарообороту мы имеем возможность удерживать одни из самых
                    низких цен в регионе. Мы также активно сотрудничаем с региональными клиентами и осуществляем
                    доставку запчастей во все города России с помощью зарекомендовавших себя транспортных компаний.
                    Возможна доставка, как единичных, так и крупнооптовых заказов. С нами работают десятки магазинов
                    автозапчастей, крупные сервисные центры, транспортные компании с внушительными автопарками.
                    Менеджеры отдела запасных частей помогут правильно подобрать необходимые запасные части, а так же в
                    короткие сроки обработать крупные заявки оптовых клиентов.
                </p>

                <p class="lead mb-4">
                    Дополнительная информация по телефону: +7 (495) 66-44-100
                </p>
            </div>
        </div>
    </div>
@endsection
